---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.LostEditsJoinsRedoFaceBased
source: html/ec37c8a4-57cb-78ad-3a5e-e0b462743f15.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.LostEditsJoinsRedoFaceBased Property

Previous edits and /or wall joins will not be preserved on this operation.

## Syntax (C#)
```csharp
public static FailureDefinitionId LostEditsJoinsRedoFaceBased { get; }
```